أنا امنيه ايمن طايع 
اليوم الاول
• عرفت في البداية إزاي أدور على مصادر صح للتعليم عشان متشتتش وسط الكورسات.
• عملت سيرش عن أساسيات البرمجة ولقيت بلايليست للمهندس عبد الرحمن جمال وسمعت جزء منها
• فهمت يعني إيه Syntax وطريقة كتابة الكود البرمجي بتمشي إزاي.عرفت يعني إيه متغيرات (Variables) وإزاي بنستخدمها عشان نخزن فيها البيانات.
• اتعلمت إزاي أربط وأدمج النصوص مع بعضها جوه الكود.اتعرفت على أنواع البيانات المختلفة (Data Types) في البرمجة.
• اتعلمت إزاي أعمل توثيق (Documentation) للمشاريع وأعمل ملف شرح على منصة Readme.me بشكل منظم ومحترف.الحمد لله
• خلصت التّاسك الأول المطلوب مني بالكامل 
• هكمل باقي الفيديوهات والدروس في البلايليست بتاعة عبد الرحمن جمال عشان أثبت الأساسيات أكتر.هبدأ أطبق عملي بإيدي وأعمل أول ملف README.md تجريبي خاص بيا. 
اليوم الثاني
• اتعلمت الـ Strings وطرق التحكم فيها وجلب طولها.
• اتعلمت الـ Lists وازاي أضيف وأعدل وأحذف عناصرها. 
• اتعلمت الـ Tuples وازاي بتحمي البيانات من التعديل.
• اتعلمت أدوات المقارنة والروابط المنطقية (and, or).
• اتعلمت جمل الـ if والـ elif والـ else وازاي البرنامج بياخد قرارات [1.1.1، 1.1.5].
وحليت شوية تمارين وتطبيقات عملية عليهم كلهم.
مشاكل واجهتني:
شوية لغبطة في الفرق بين الـ List والـ Tuple وامتداد استخدام كل واحدة فيهم.لغبطة بسيطة في دمج كذا شرط مع بعض باستخدام الـ and والـ or في جمل الـ if، بس مع التدريب بدأت تظبط معايا.
بدأت أحاول أحاكي تفكير البشمهندس عبدالرحمن جمال وازاي بيقسم المشكلة قبل ما يكتب الكود......
مصادر التعلم:
كورس بايثون للمبتدئين - البشمهندس عبدالرحمن جمال 
شات جي بي تي / جيميناي للأسئلة السريعة
اليوم الثالت
‌ كملت باقي البلاي ليست 
‌اتعلمت الـ  python Basics كلها
‌عدلت التاسكات الاول والتالت بناءاً علي اللي اتعلمتو

اليوم الرابع
‌عدت كل البلاي ليست تاني عشان نسيت الخصها  ف لخصتها 
‌عدت فيديوهات مهارات التعلم تاني عشان الخصها
‌خلصت التاسك التاني  بس كان عندي افكار أضيفها ليه بس ملحقتش مكنش في وقت
 
اليوم الخامس
‌ كملت فديوهات مهارات التعلم ولخصتها كلها 
‌عدت تاني فيديوز اساسيات البرمجه ولخصتها 
‌عملت التاسك الرابع وكنت حابه اضيفو افكار مختلفه بس ملحقتش 
 
اليوم السادس
‌ سلمت التاسكات 
‌عملت ملف readme.md باللي انجزتو خلاص الاسبوع